package practice01;
		// 8일차 (배열)
public class practice13 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// 배열 (array)
//		배열은 언제 사용할까?
//		프로그래밍하다 보면 변수가 여러개 필요할때가 있다.
//		예를 들어 학생 1000명의 점수를 저장해야 한다
//		그럼 학생이 1000명이니 점수도 1000개 이를 저장할 변수도 1000개가 필요하다 이렇게 변수가 많아지면 변수를 선언하는 것만으로도 힘들다
//		이럴 때 배열을 사용한다
//		즉 배열은 데이터형이 같은 변수가 여러개 필요할 때 사용한다
//		변수는 하나인데 값은 여러개 들어갈 때 이다
//		정수 100개를 저장할 수 있는 배열을 만들어보자
//		우선 정수를 저장하므로 int형 변수여야 한다
//		하지만 앞에서 선언한 int형 변수와는 다르다
//		int[] array1 = new int[100];
//		지금 선언하는 것은 배열이므로 자료형 int 다음에 배열을 나타내는 대괄호를 넣고 배열명 array1로 넣어 선언한다
//		다음으로 배열을 생성하는데 이때 반드시 new라는 키워드를 사용해야 한다
//		int형을 담을 것이고 100개를 담는다고 지정한다
//		배열은 처음 선언할때 만든 크기가 변하지 않는다
//		배열에 값을 넣어줄때는 배열의 이름과 배열 표시인 대괄호 안에 인덱스(index)를 적어줘야 한다
//		인덱스란?
//		배열은 저장 공간이 여러 개인데 변수는 배열 전체를 가리키기 때문에 배열 안 값을 하나씩 가리킬 방법이 필요하다
//		그래서 배열의 여러 공간에 번호를 붙여 놓는다
//		그것이 바로 인덱스인다
//		인덱스를 이용하면 배열의 몇번째 값을 가리키는지 알 수 있다.
//		자바는 인덱스를 0번부터 사용하므로 100개라면 인덱스는 0~99까지 사용할 수 있다
//		아래 예제는
//		array1의 0번 인덱스에 50이라는 값을 담는다
//		array1의 10번 인덱스에 100이라는 값을 담는다
//		라는 뜻이다
//		int[] array1 = new int[100];
//		array1[0]=50;     //array1의 0번 인덱스에 50이라는 값을 담는다
//		array1[10]=100;   //array1의 10번 인덱스에 100이라는 값을 담는다
		
		
	}

}
